Конвертация_данных_31_демо.Conversion_3_Plus/src/Enums/Расш1_ТемыКонсолиКода/Расш1_ТемыКонсолиКода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Расш1_ТемыКонсолиКода</name>
  <enumValues>
    <name>White</name>
  </enumValues>
  <enumValues>
    <name>WhiteQuery</name>
  </enumValues>
  <enumValues>
    <name>Dark</name>
  </enumValues>
  <enumValues>
    <name>DarkQuery</name>
  </enumValues>
  <enumValues>
    <name>EDTWhite</name>
  </enumValues>
  <enumValues>
    <name>EDTDark</name>
  </enumValues>
</mdclass:Enum>

Конвертация_данных_31_демо.Conversion_3_Plus/src/Enums/Расш1_НасыщенностьШрифтаКонсоли/Расш1_НасыщенностьШрифтаКонсоли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Расш1_НасыщенностьШрифтаКонсоли</name>
  <enumValues>
    <name>Normal</name>
  </enumValues>
  <enumValues>
    <name>Bold</name>
  </enumValues>
  <enumValues>
    <name>Lighter</name>
  </enumValues>
  <enumValues>
    <name>Bolder</name>
  </enumValues>
</mdclass:Enum>

Конвертация_данных_31_демо.Conversion_3_Plus/src/CommonModules/Расш1_КонсольКодаКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Имя реквизита формы с кэшем текста HTML-макета консоли.
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяРеквизитаКэшаHTML() Экспорт
	
	Возврат "Расш1_ТекстHTMLКонсоли";
	
КонецФункции

// Имя реквизита формы со списком имён HTML-полей консолей.
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяРеквизитаИменКонсолей() Экспорт
	
	Возврат "Расш1_ИменаКонсолей";
	
КонецФункции

// Имя реквизита формы с картой HTML-поле → реквизит алгоритма.
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяРеквизитаКартыКонсолей() Экспорт
	
	Возврат "Расш1_КартаКонсолей";
	
КонецФункции

// Имя поля HTML хоста консоли на форме.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяЭлементаХостаКонсоли() Экспорт
	
	Возврат "Расш1_КонсольHTML";
	
КонецФункции

// Имя реквизита реестра алгоритмов хоста.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяРеквизитаРеестраАлгоритмов() Экспорт
	
	Возврат "Расш1_РеестрАлгоритмов";
	
КонецФункции

// Имя реквизита текущего пути данных алгоритма хоста.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяРеквизитаТекущегоПутиАлгоритма() Экспорт
	
	Возврат "Расш1_ТекущийПутьАлгоритма";
	
КонецФункции

// Имя реквизита списка уже открытых страниц алгоритмов.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяРеквизитаОткрытыхСтраниц() Экспорт
	
	Возврат "Расш1_ОткрытыеСтраницыАлгоритмов";
	
КонецФункции

// Имя командной панели хоста консоли.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяПанелиКомандХоста() Экспорт
	
	Возврат ИмяЭлементаХостаКонсоли() + "ПанельКоманд";
	
КонецФункции

// Имя подменю направления хоста.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяГруппыНаправленияХоста() Экспорт
	
	Возврат "Направление" + ИмяЭлементаХостаКонсоли();
	
КонецФункции

// Имя элемента поля HTML по имени исходного поля алгоритма.
//
// Параметры:
//  ИмяЭлементаАлгоритма - Строка
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяЭлементаHTML(ИмяЭлементаАлгоритма) Экспорт
	
	Возврат ИмяЭлементаАлгоритма + "HTML";
	
КонецФункции

// Имя реквизита «консоль сформирована».
//
// Параметры:
//  ИмяЭлементаHTML - Строка
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяПризнакаСформирована(ИмяЭлементаHTML) Экспорт
	
	Возврат ИмяЭлементаHTML + "Сформирован";
	
КонецФункции

// Имя события bsl_console при изменении текста.
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяСобытияИзменениеСодержимого() Экспорт
	
	Возврат "EVENT_CONTENT_CHANGED";
	
КонецФункции

// Имя события bsl_console при запросе метаданных.
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяСобытияПолучениеМетаданных() Экспорт
	
	Возврат "EVENT_GET_METADATA";
	
КонецФункции


// Префикс команды открытия формы настроек консоли.
// 
// Возвращаемое значение:
//  Строка
//
Функция ПрефиксКомандыНастроек() Экспорт
	
	Возврат "Расш1_НастройкиКонсоли";
	
КонецФункции

// Имя события оповещения после записи настроек консоли.
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяСобытияНастройкиИзменены() Экспорт
	
	Возврат "Расш1_НастройкиКонсолиИзменены";
	
КонецФункции

// Ключ объекта хранилища общих настроек консоли.
// 
// Возвращаемое значение:
//  Строка
//
Функция КлючОбъектаНастроек() Экспорт
	
	Возврат "Расш1_КонсольКода";
	
КонецФункции

// Ключ настройки редактора в хранилище общих настроек.
// 
// Возвращаемое значение:
//  Строка
//
Функция КлючНастройкиРедактора() Экспорт
	
	Возврат "НастройкиРедактора";
	
КонецФункции

// Имя общей формы настроек консоли.
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяФормыНастроекКонсоли() Экспорт
	
	Возврат "ОбщаяФорма.Расш1_НастройкиКонсолиКода";
	
КонецФункции

// Настройки редактора по умолчанию.
//
// Возвращаемое значение:
//  Структура:
//   * ИспользоватьКонсольКода - Булево
//   * Тема - ПеречислениеСсылка.Расш1_ТемыКонсолиКода
//   * РазмерШрифта - Число
//   * СемействоШрифтов - Строка
//   * НасыщенностьШрифта - ПеречислениеСсылка.Расш1_НасыщенностьШрифтаКонсоли, Неопределено - пусто, если setFontWeight не вызывать.
//   * ВысотаСтроки - Число
//   * КартаКода - Булево
//   * ПереносСтрок - Булево
//   * НомераСтрок - Булево
//   * СтрокаСостояния - Булево
//   * ОтображатьПробелы - Булево
//   * Сворачивание - Булево
//   * ПодсветкаКавычек - Булево
//   * БыстрыеПодсказки - Булево
//   * ЯзыкПодсказок - Строка
//   * АвтоРазмер - Булево
//
Функция НовыеНастройкиРедактора() Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("ИспользоватьКонсольКода", Истина);
	Настройки.Вставить("Тема", ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.White"));
	Настройки.Вставить("РазмерШрифта", 0);
	Настройки.Вставить("СемействоШрифтов", "");
	Настройки.Вставить("НасыщенностьШрифта", Неопределено);
	Настройки.Вставить("ВысотаСтроки", 0);
	Настройки.Вставить("КартаКода", Ложь);
	Настройки.Вставить("ПереносСтрок", Ложь);
	Настройки.Вставить("НомераСтрок", Истина);
	Настройки.Вставить("СтрокаСостояния", Ложь);
	Настройки.Вставить("ОтображатьПробелы", Ложь);
	Настройки.Вставить("Сворачивание", Истина);
	Настройки.Вставить("ПодсветкаКавычек", Ложь);
	Настройки.Вставить("БыстрыеПодсказки", Истина);
	Настройки.Вставить("ЯзыкПодсказок", "ru");
	Настройки.Вставить("АвтоРазмер", Истина);
	
	Возврат Настройки;
	
КонецФункции

// Дополнить загруженные настройки ключами по умолчанию.
//
// Параметры:
//  Настройки - Структура, Неопределено - сохраненные настройки или отсутствие.
//
// Возвращаемое значение:
//  См. НовыеНастройкиРедактора
//
Функция ДополнитьНастройкиРедактора(Настройки) Экспорт
	
	Результат = НовыеНастройкиРедактора();
	Если ТипЗнч(Настройки) <> Тип("Структура") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из Результат Цикл
		Если Не Настройки.Свойство(КлючИЗначение.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		Значение = Настройки[КлючИЗначение.Ключ];
		Если КлючИЗначение.Ключ = "Тема" Тогда
			Результат.Тема = ТемаИзСохраненногоЗначения(Значение);
		ИначеЕсли КлючИЗначение.Ключ = "НасыщенностьШрифта" Тогда
			Результат.НасыщенностьШрифта = НасыщенностьИзСохраненногоЗначения(Значение);
		Иначе
			Результат[КлючИЗначение.Ключ] = Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Признак, что на формах правил нужно создавать HTML-хост вместо типового поля.
//
// Параметры:
//  Настройки - Структура, Неопределено - настройки редактора; если Неопределено, считается включённой.
//
// Возвращаемое значение:
//  Булево
//
Функция КонсольВключена(Настройки = Неопределено) Экспорт
	
	Если ТипЗнч(Настройки) <> Тип("Структура") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Значение = Неопределено;
	Если Настройки.Свойство("ИспользоватьКонсольКода", Значение) Тогда
		Возврат Значение <> Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Имя темы для setTheme по значению перечисления.
//
// Параметры:
//  Тема - ПеречислениеСсылка.Расш1_ТемыКонсолиКода, Строка - значение настройки или имя API.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяТемыAPI(Тема) Экспорт
	
	Если ТипЗнч(Тема) = Тип("Строка") Тогда
		Если Не ПустаяСтрока(Тема) Тогда
			Возврат Тема;
		КонецЕсли;
		Возврат "bsl-white";
	КонецЕсли;
	
	Если Тема = ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.WhiteQuery") Тогда
		Возврат "bsl-white-query";
	ИначеЕсли Тема = ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.Dark") Тогда
		Возврат "bsl-dark";
	ИначеЕсли Тема = ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.DarkQuery") Тогда
		Возврат "bsl-dark-query";
	ИначеЕсли Тема = ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.EDTWhite") Тогда
		Возврат "bsl-edt-white";
	ИначеЕсли Тема = ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.EDTDark") Тогда
		Возврат "bsl-edt-dark";
	КонецЕсли;
	
	Возврат "bsl-white";
	
КонецФункции

// Имя насыщенности для setFontWeight. Пустая строка — не вызывать API.
//
// Параметры:
//  Насыщенность - ПеречислениеСсылка.Расш1_НасыщенностьШрифтаКонсоли, Строка, Неопределено - значение настройки или имя API.
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяНасыщенностиAPI(Насыщенность) Экспорт
	
	Если ТипЗнч(Насыщенность) = Тип("Строка") Тогда
		Возврат Насыщенность;
	КонецЕсли;
	
	Если Насыщенность = ПредопределенноеЗначение("Перечисление.Расш1_НасыщенностьШрифтаКонсоли.Normal") Тогда
		Возврат "normal";
	ИначеЕсли Насыщенность = ПредопределенноеЗначение("Перечисление.Расш1_НасыщенностьШрифтаКонсоли.Bold") Тогда
		Возврат "bold";
	ИначеЕсли Насыщенность = ПредопределенноеЗначение("Перечисление.Расш1_НасыщенностьШрифтаКонсоли.Lighter") Тогда
		Возврат "lighter";
	ИначеЕсли Насыщенность = ПредопределенноеЗначение("Перечисление.Расш1_НасыщенностьШрифтаКонсоли.Bolder") Тогда
		Возврат "bolder";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Нормализовать перевод строки к Windows CRLF при записи из хоста в реквизит.
//
// Параметры:
//  Текст - Строка
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстСПереносамиWindows(Текст) Экспорт
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат Текст;
	КонецЕсли;
	
	Нормализованный = СтрЗаменить(Текст, Символы.ВК, "");
	Возврат СтрЗаменить(Нормализованный, Символы.ПС, Символы.ВК + Символы.ПС);
	
КонецФункции

// Префикс команды замены вхождений.
// 
// Возвращаемое значение:
//  Строка
//
Функция ПрефиксКомандыЗаменитьВхождения() Экспорт
	
	Возврат "ЗаменитьВхождения";
	
КонецФункции

// Префикс команды направления «Отправка».
// 
// Возвращаемое значение:
//  Строка
//
Функция ПрефиксКомандыОтправка() Экспорт
	
	Возврат "Отправка";
	
КонецФункции

// Префикс команды направления «Получение».
// 
// Возвращаемое значение:
//  Строка
//
Функция ПрефиксКомандыПолучение() Экспорт
	
	Возврат "Получение";
	
КонецФункции

// Имя подключаемого обработчика документа HTML.
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяОбработчикаДокументСформирован() Экспорт
	
	Возврат "Расш1_Подключаемый_КонсольДокументСформирован";
	
КонецФункции

// Имя подключаемого обработчика нажатия HTML.
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяОбработчикаПриНажатии() Экспорт
	
	Возврат "Расш1_Подключаемый_КонсольПриНажатии";
	
КонецФункции

// Имя подключаемого обработчика команд консоли.
// 
// Возвращаемое значение:
//  Строка
//
Функция ИмяОбработчикаКомандыКонсоли() Экспорт
	
	Возврат "Расш1_Подключаемый_КомандаКонсоли";
	
КонецФункции

// Описание алгоритма в реестре хоста.
//
// Возвращаемое значение:
//  Структура:
//   * ИмяСтраницы - Строка
//   * ПутьКДанным - Строка
//   * ПоказыватьНаправление - Булево
//   * ТолькоПросмотр - Булево
//   * АвтоНаправление - Строка
//   * СкрытьПанельКоманд - Булево
//
Функция НовыйОписаниеАлгоритма() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("ИмяСтраницы", "");
	Описание.Вставить("ПутьКДанным", "");
	Описание.Вставить("ПоказыватьНаправление", Истина);
	Описание.Вставить("ТолькоПросмотр", Ложь);
	Описание.Вставить("АвтоНаправление", "");
	Описание.Вставить("СкрытьПанельКоманд", Ложь);
	
	Возврат Описание;
	
КонецФункции

// Добавить описание алгоритма в строку реестра.
//
// Параметры:
//  Реестр - Строка
//  Описание - см. НовыйОписаниеАлгоритма
//
// Возвращаемое значение:
//  Строка
//
Функция ДобавитьОписаниеВРеестр(Реестр, Описание) Экспорт
	
	Если Не ПустаяСтрока(НайтиОписаниеАлгоритма(Реестр, Описание.ИмяСтраницы).ИмяСтраницы) Тогда
		Возврат Реестр;
	КонецЕсли;
	
	Запись = СтрокаРеестраИзОписания(Описание);
	Если ПустаяСтрока(Реестр) Тогда
		Возврат Запись;
	КонецЕсли;
	
	Возврат Реестр + ";" + Запись;
	
КонецФункции

// Найти описание алгоритма по имени страницы.
//
// Параметры:
//  Реестр - Строка
//  ИмяСтраницы - Строка
//
// Возвращаемое значение:
//  см. НовыйОписаниеАлгоритма
//
Функция НайтиОписаниеАлгоритма(Реестр, ИмяСтраницы) Экспорт
	
	Для Каждого Описание Из РазобратьРеестр(Реестр) Цикл
		Если Описание.ИмяСтраницы = ИмяСтраницы Тогда
			Результат = НовыйОписаниеАлгоритма();
			ЗаполнитьЗначенияСвойств(Результат, Описание);
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НовыйОписаниеАлгоритма();
	
КонецФункции

// Разобрать строку реестра в массив описаний.
//
// Параметры:
//  Реестр - Строка
//
// Возвращаемое значение:
//  Массив из см. НовыйОписаниеАлгоритма
//
Функция РазобратьРеестр(Реестр) Экспорт
	
	Результат = Новый Массив;
	Если ПустаяСтрока(Реестр) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого Запись Из СтрРазделить(Реестр, ";", Ложь) Цикл
		Описание = ОписаниеИзСтрокиРеестра(Запись);
		Если Описание <> Неопределено Тогда
			Результат.Добавить(Описание);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Разобрать путь к данным алгоритма.
//
// Параметры:
//  Путь - Строка - «Объект.Имя» или имя реквизита формы.
//
// Возвращаемое значение:
//  Структура:
//   * ЭтоРеквизитОбъекта - Булево
//   * ИмяРеквизита - Строка
//
Функция ЧастиПутиДанных(Путь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЭтоРеквизитОбъекта", Ложь);
	Результат.Вставить("ИмяРеквизита", Путь);
	
	ПрефиксОбъекта = "Объект.";
	Если СтрНачинаетсяС(Путь, ПрефиксОбъекта) Тогда
		Результат.ЭтоРеквизитОбъекта = Истина;
		Результат.ИмяРеквизита = Сред(Путь, СтрДлина(ПрефиксОбъекта) + 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавить имя в список через запятую, если его ещё нет.
//
// Параметры:
//  Список - Строка
//  Имя - Строка
//
// Возвращаемое значение:
//  Строка
//
Функция ДобавитьИмяВСписок(Список, Имя) Экспорт
	
	Если ПустаяСтрока(Имя) Или ИмяЕстьВСписке(Список, Имя) Тогда
		Возврат Список;
	КонецЕсли;
	
	Если ПустаяСтрока(Список) Тогда
		Возврат Имя;
	КонецЕсли;
	
	Возврат Список + "," + Имя;
	
КонецФункции

// Признак наличия имени в списке через запятую.
//
// Параметры:
//  Список - Строка
//  Имя - Строка
//
// Возвращаемое значение:
//  Булево
//
Функция ИмяЕстьВСписке(Список, Имя) Экспорт
	
	Если ПустаяСтрока(Имя) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СтрНайти("," + Список + ",", "," + Имя + ",") > 0;
	
КонецФункции

// Нужно ли сбрасывать текст редактора в реквизит алгоритма.
//
// Параметры:
//  ХостСформирован - Булево
//  СтраницаОткрывалась - Булево
//
// Возвращаемое значение:
//  Булево
//
Функция НужноЗаписатьТекстАлгоритма(ХостСформирован, СтраницаОткрывалась) Экспорт
	
	Возврат ХостСформирован И СтраницаОткрывалась;
	
КонецФункции

// Признак: в реестре есть алгоритм с видимым направлением.
//
// Параметры:
//  Реестр - Строка
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьАлгоритмСНаправлением(Реестр) Экспорт
	
	Для Каждого Описание Из РазобратьРеестр(Реестр) Цикл
		Если Описание.ПоказыватьНаправление Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокаРеестраИзОписания(Описание)
	
	Части = Новый Массив;
	Части.Добавить(Описание.ИмяСтраницы);
	Части.Добавить(Описание.ПутьКДанным);
	Части.Добавить(ФлагИзБулево(Описание.ПоказыватьНаправление));
	Части.Добавить(ФлагИзБулево(Описание.ТолькоПросмотр));
	Части.Добавить(Описание.АвтоНаправление);
	Части.Добавить(ФлагИзБулево(Описание.СкрытьПанельКоманд));
	
	Возврат СтрСоединить(Части, "|");
	
КонецФункции

Функция ОписаниеИзСтрокиРеестра(Запись)
	
	Части = СтрРазделить(Запись, "|");
	Если Части.Количество() < 6 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Описание = НовыйОписаниеАлгоритма();
	Описание.ИмяСтраницы = Части[0];
	Описание.ПутьКДанным = Части[1];
	Описание.ПоказыватьНаправление = БулевоИзФлага(Части[2]);
	Описание.ТолькоПросмотр = БулевоИзФлага(Части[3]);
	Описание.АвтоНаправление = Части[4];
	Описание.СкрытьПанельКоманд = БулевоИзФлага(Части[5]);
	
	Возврат Описание;
	
КонецФункции

Функция ФлагИзБулево(Значение)
	
	Возврат ?(Значение, "1", "0");
	
КонецФункции

Функция БулевоИзФлага(Флаг)
	
	Возврат Флаг = "1";
	
КонецФункции

Функция ТемаИзСохраненногоЗначения(Значение)
	
	Если ТипЗнч(Значение) = Тип("ПеречислениеСсылка.Расш1_ТемыКонсолиКода") Тогда
		Если ЗначениеЗаполнено(Значение) Тогда
			Возврат Значение;
		КонецЕсли;
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.White");
	КонецЕсли;
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.White");
	КонецЕсли;
	
	Если Значение = "bsl-white-query" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.WhiteQuery");
	ИначеЕсли Значение = "bsl-dark" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.Dark");
	ИначеЕсли Значение = "bsl-dark-query" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.DarkQuery");
	ИначеЕсли Значение = "bsl-edt-white" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.EDTWhite");
	ИначеЕсли Значение = "bsl-edt-dark" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.EDTDark");
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.Расш1_ТемыКонсолиКода.White");
	
КонецФункции

Функция НасыщенностьИзСохраненногоЗначения(Значение)
	
	Если ТипЗнч(Значение) = Тип("ПеречислениеСсылка.Расш1_НасыщенностьШрифтаКонсоли") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Значение = "normal" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_НасыщенностьШрифтаКонсоли.Normal");
	ИначеЕсли Значение = "bold" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_НасыщенностьШрифтаКонсоли.Bold");
	ИначеЕсли Значение = "lighter" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_НасыщенностьШрифтаКонсоли.Lighter");
	ИначеЕсли Значение = "bolder" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.Расш1_НасыщенностьШрифтаКонсоли.Bolder");
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
